Revit 2027 API
IFCData.AsAggregate Method
 Gets storage value as IFCAggregate when its PrimitiveType is aggregate.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAggregate AsAggregate()
Public Function AsAggregate As IFCAggregate
public:
IFCAggregate^ AsAggregate()
member AsAggregate : unit -> IFCAggregate
Return Value
IFCAggregate
 The IFCAggregate.
Exceptions
Exception | Condition
InapplicableDataException |  The primitive type is not aggregate.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace